$(function()
{
//Робота з html елементами
//Метод click() - встановлює обробник  для "клацання" на елементі
//обробник - це функція
// Методи з однаковою конструкцією text(),html()
//text() - дозволяє змінювати текст елементу та отримувати текст разом з тегами
//html() - отримання вмісту елемента та заміна вмісту елемента

/*ЗАВДАННЯ 14.1 При кліку на будь-який елемент списку відобразити весь його html-код обраного елементу. */
$('li').click(function(){
	alert($(this).html());
})
//Метод .val() використовується для відображення того що знаходиться в полях, списках, перемикачах, прапорцях тощо(отримання значень елементів форми). 
/*ЗАВДАННЯ 14.2
При завантаженні сторінки відобразити у діалоговому вікні значення, яке вписано у текстове поле для пошти. */
alert($('#email').val());

// Метод .attr() дозволяє отримати та змінити атрибут елемента
/*ЗАВДАННЯ 14.3
При кліку на посилання на сайти виробників мотоциклів у діалоговому вікні відобразити значення атрибуту href обраного елементу.*/  
$('.link-moto').click(function(){
	alert($(this).attr('href'));
})
//ЗАВДАННЯ 14.6 При кліку на кнопку хедеру потрібно змінити код останнього елементу меню, який відповідає за мову сторінки. У якості коду відобразити зображення pic_eng.png. 
$('.slide-btn').click(function()
{$('.m6').html('<img src="images/pic_eng.png" width="80">');
}
)
//Додавання тексту або коду елементу
/*ЗАВДАННЯ 14.8
При кліку на зображення мотоциклу, потрібно змінити код заголовку обраного елементу. Перед поточним текстом заголовку додати курсивний текст "Ви обрали: " і два переходи на новий рядок. */
$('.head-moto-img').click(function()
{
	$('+h3>a',this).text(function(i,orig)
	{
		return 'Ви обрали:' +orig;
	});
	
})
	
});